capiman/lpc21isp/lpc21isp.c
            if (stricmp(argv[i], "-Verify") == 0)
            {
                IspEnvironment->Verify = 1;
                DebugPrintf(2, "Verify after copy RAM to Flash.\n");
                continue;
            }

#ifdef INTEGRATED_IN_WIN_APP
            if (stricmp(argv[i], "-nosync") == 0)
            {
                IspEnvironment->NoSync = 1;
                DebugPrintf(2, "Performing no syncing, already done.\n");
                continue;
            }
#endif

#ifdef TERMINAL_SUPPORT
            if (CheckTerminalParameters(IspEnvironment, argv[i]))
            {
                continue;
            }
#endif

            if(*argv[i] == '-') DebugPrintf( 2, "Unknown command line option: \"%s\"\n", argv[i]);
            else
            {
                int ret_val;
                if(IspEnvironment->FileFormat == FORMAT_HEX)
                {
                    ret_val = AddFileHex(IspEnvironment, argv[i]);
                }
                else
                {
                    ret_val = AddFileBinary(IspEnvironment, argv[i]);
                }
                if( ret_val != 0)
                {
                    DebugPrintf( 2, "Unknown command line option: \"%s\"\n", argv[i]);
                }
            }
        }

        // Newest cygwin delivers a '\x0d' at the end of argument
        // when calling lpc21isp from batch file
        for (i = 0; i < strlen(argv[argc - 1]) && i < (sizeof(IspEnvironment->StringOscillator) - 1) &&
            argv[argc - 1][i] >= '0' && argv[argc - 1][i] <= '9'; i++)
        {
            IspEnvironment->StringOscillator[i] = argv[argc - 1][i];
        }
        IspEnvironment->StringOscillator[i] = 0;

        IspEnvironment->serial_port = argv[argc - 3];
        IspEnvironment->baud_rate = argv[argc - 2];
    }

    if (argc < 5)
    {
        debug_level = (debug_level < 2) ? 2 : debug_level;
    }

    if (argc < 5)
    {
        DebugPrintf(2, "\n"
                       "Portable command line ISP\n"
                       "for NXP LPC family and Analog Devices ADUC 70xx\n"
                       "Version " VERSION_STR " compiled for " COMPILED_FOR ": " __DATE__ ", " __TIME__ "\n"
                       "Copyright (c) by Martin Maurer, 2003-2013, Email: Martin.Maurer@clibb.de\n"
                       "Portions Copyright (c) by Aeolus Development 2004, www.aeolusdevelopment.com\n"
                       "\n");

        DebugPrintf(1, "Syntax:  lpc21isp [Options] file[ file[ ...]] comport baudrate Oscillator_in_kHz\n\n"
                       "Example: lpc21isp test.hex com1 115200 14746\n\n"
                       "Options: -bin         for uploading binary file\n"
                       "         -hex         for uploading file in intel hex format (default)\n"
                       "         -term        for starting terminal after upload\n"
                       "         -termonly    for starting terminal without an upload\n"
                       "         -localecho   for local echo in terminal\n"
                       "         -detectonly  detect only used LPC chiptype (NXPARM only)\n"
                       "         -debug0      for no debug\n"
                       "         -debug3      for progress info only\n"
                       "         -debug5      for full debug\n"
                       "         -donotstart  do not start MCU after download\n"
                       "         -try<n>      try n times to synchronise\n"
                       "         -wipe        Erase entire device before upload\n"
                       "         -control     for controlling RS232 lines for easier booting\n"
                       "                      (Reset = DTR, EnableBootLoader = RTS)\n"
                       "         -boothold    hold EnableBootLoader asserted throughout sequence\n"
#ifdef INTEGRATED_IN_WIN_APP
                       "         -nosync      Do not synchronize device via '?'\n"
#endif
                       "         -controlswap swap RS232 control lines\n"
                       "                      (Reset = RTS, EnableBootLoader = DTR)\n"
                       "         -controlinv  Invert state of RTS & DTR \n"
                       "                      (0=true/assert/set, 1=false/deassert/clear).\n"
                       "         -verify      Verify the data in Flash after every writes to\n"
                       "                      sector. To detect errors in writing to Flash ROM\n"
                       "         -logfile     for enabling logging of terminal output to lpc21isp.log\n"
                       "         -halfduplex  use halfduplex serial communication (i.e. with K-Line)\n"
                       "         -ADARM       for downloading to an Analog Devices\n"
                       "                      ARM microcontroller ADUC70xx\n"
                       "         -NXPARM      for downloading to a chip of NXP LPC family (default)\n");

        exit(1);
    }

    if (IspEnvironment->micro == NXP_ARM)
    {
        // If StringOscillator is bigger than 100 MHz, there seems to be something wrong
        if (strlen(IspEnvironment->StringOscillator) > 5)
        {
            DebugPrintf(1, "Invalid crystal frequency %s\n", IspEnvironment->StringOscillator);
            exit(1);
        }
    }
}

/***************************** ResetTarget ******************************/
/**  Resets the target leaving it in either download (program) mode or
run mode.
\param [in] mode the mode to leave the target in.
*/
void ResetTarget(ISP_ENVIRONMENT *IspEnvironment, TARGET_MODE mode)
{
#if defined(__linux__) && defined(GPIO_RST) && defined(GPIO_ISP)

// This code section allows using Linux GPIO pins to control the -RST and -ISP
// signals of the target microcontroller.
//
// Build lpc21isp to use Linux GPIO like this:
//
// make CFLAGS="-Wall -DGPIO_ISP=23 -DGPIO_RST=18"
//
// The GPIO pins must be pre-configured in /etc/rc.local (or other startup script)
// similar to the following:
//
// # Configure -ISP signal
// echo 23 >/sys/class/gpio/export
// echo out >/sys/class/gpio/gpio23/direction
// echo 1 >/sys/class/gpio/gpio23/value
// chown root.gpio /sys/class/gpio/gpio23/value
// chmod 660 /sys/class/gpio/gpio23/value
//
// # Configure -RST signal
// echo 18 >/sys/class/gpio/export
// echo out >/sys/class/gpio/gpio18/direction
// echo 1 >/sys/class/gpio/gpio18/value
// chown root.gpio /sys/class/gpio/gpio18/value
// chmod 660 /sys/class/gpio/gpio18/value
//
// Then if the user is a member of the gpio group, lpc21isp will not requre any
// special permissions to access the GPIO signals.

