capiman/lpc21isp/lpc21isp.c
  char gpio_isp_filename[256];
  char gpio_rst_filename[256];
  int gpio_isp;
  int gpio_rst;

  memset(gpio_isp_filename, 0, sizeof(gpio_isp_filename));
  sprintf(gpio_isp_filename, "/sys/class/gpio/gpio%d/value", GPIO_ISP);

  memset(gpio_rst_filename, 0, sizeof(gpio_rst_filename));
  sprintf(gpio_rst_filename, "/sys/class/gpio/gpio%d/value", GPIO_RST);

  gpio_isp = open(gpio_isp_filename, O_WRONLY);
  if (gpio_isp < 0)
  {
    fprintf(stderr, "ERROR: open() for %s failed, %s\n", gpio_isp_filename, strerror(errno));
    exit(1);
  }

  gpio_rst = open(gpio_rst_filename, O_WRONLY);
  if (gpio_rst < 0)
  {
    fprintf(stderr, "ERROR: open() for %s failed, %s\n", gpio_rst_filename, strerror(errno));
    exit(1);
  }

  switch (mode)
  {
    case PROGRAM_MODE :
      write(gpio_isp, "0\n", 2);  // Assert -ISP
      Sleep(100);
      write(gpio_rst, "0\n", 2);  // Assert -RST
      Sleep(500);
      write(gpio_rst, "1\n", 2);  // Deassert -RST
      Sleep(100);
      write(gpio_isp, "1\n", 2);  // Deassert -ISP
      Sleep(100);
      break;;

    case RUN_MODE :
      write(gpio_rst, "0\n", 2);  // Assert -RST
      Sleep(500);
      write(gpio_rst, "1\n", 2);  // Deassert -ISP
      Sleep(100);
      break;;
  }

  close(gpio_isp);
  close(gpio_rst);

  return;
#endif

    if (IspEnvironment->ControlLines)
    {
        switch (mode)
        {
        /* Reset and jump to boot loader.                       */
        case PROGRAM_MODE:
            ControlModemLines(IspEnvironment, 1, 1);
            Sleep(100);
            ClearSerialPortBuffers(IspEnvironment);
            Sleep(100);
            ControlModemLines(IspEnvironment, 0, 1);
            //Longer delay is the Reset signal is conected to an external rest controller
            Sleep(500);
            // Clear the RTS line after having reset the micro
            // Needed for the "GO <Address> <Mode>" ISP command to work */
            if(!IspEnvironment->BootHold)
            {
                ControlModemLines(IspEnvironment, 0, 0);
            }
            break;

        /* Reset and start uploaded program                     */
        case RUN_MODE:
            ControlModemLines(IspEnvironment, 1, 0);
            Sleep(100);
            ClearSerialPortBuffers(IspEnvironment);
            Sleep(100);
            ControlModemLines(IspEnvironment, 0, 0);
            Sleep(100);
            break;
        }
    }
}


/***************************** Ascii2Hex ********************************/
/**  Converts a hex character to its equivalent number value. In case of an
error rather abruptly terminates the program.
\param [in] c the hex digit to convert.
\return the value of the hex digit.
*/
static unsigned char Ascii2Hex(unsigned char c)
{
    if (c >= '0' && c <= '9')
    {
        return (unsigned char)(c - '0');
    }

    if (c >= 'A' && c <= 'F')
    {
        return (unsigned char)(c - 'A' + 10);
    }

    if (c >= 'a' && c <= 'f')
    {
        return (unsigned char)(c - 'a' + 10);
    }

    DebugPrintf(1, "Wrong Hex-Nibble %c (%02X)\n", c, c);
    exit(1);

    return 0;  // this "return" will never be reached, but some compilers give a warning if it is not present
}


/***************************** AddFileHex *******************************/
/**  Add a file to the list of files to read in, flag it as hex format.
\param [in] IspEnvironment Programming environment.
\param [in] arg The argument that was passed to the program as a file name.
\return 0 on success, an error code otherwise.
*/
static int AddFileHex(ISP_ENVIRONMENT *IspEnvironment, const char *arg)
{
    FILE_LIST *entry;

    // Add file to list.  If cannot allocate storage for node return an error.
    entry = malloc(sizeof(FILE_LIST));
    if( entry == 0)
    {
        DebugPrintf(1, "Error %d Could not allocated memory for file node %s\n", ERR_ALLOC_FILE_LIST, arg);
        return  ERR_ALLOC_FILE_LIST;
    }

    // Build up entry and insert it at the start of the list.
    entry->name = arg;
    entry->prev = IspEnvironment->f_list;
    entry->hex_flag = 1;
    IspEnvironment->f_list = entry;

    return 0;       // Success.
}


/***************************** AddFileBinary ****************************/
/**  Add a file to the list of files to read in, flag it as binary format.
\param [in] IspEnvironment Programming environment.
\param [in] arg The argument that was passed to the program as a file name.
\return 0 on success, an error code otherwise.
*/
static int AddFileBinary(ISP_ENVIRONMENT *IspEnvironment, const char *arg)
{
    FILE_LIST *entry;

    // Add file to list. If cannot allocate storage for node return an error.
    entry = malloc(sizeof(FILE_LIST));
    if( entry == 0)
    {
        DebugPrintf( 1, "Error %d Could not allocated memory for file node %s\n", ERR_ALLOC_FILE_LIST, arg);
        return  ERR_ALLOC_FILE_LIST;
    }

    // Build up entry and insert it at the start of the list.
    entry->name = arg;
    entry->prev = IspEnvironment->f_list;
    entry->hex_flag = 0;
    IspEnvironment->f_list = entry;

    return 0;       // Success.
}

#if 0
void ReadHexFile(ISP_ENVIRONMENT *IspEnvironment)
{
    LoadFile(IspEnvironment);

    if (IspEnvironment->BinaryLength)
    {
        BINARY* FileContent = IspEnvironment->FileContent;

        unsigned long  Pos;
        unsigned char  RecordLength;
        unsigned short RecordAddress;
        unsigned long  RealAddress = 0;
        unsigned char  RecordType;
        unsigned char  Hexvalue;
        unsigned long  StartAddress;
        int            BinaryOffsetDefined = 0;
        unsigned char  i;


        DebugPrintf(3, "Converting file %s to binary format...\n", IspEnvironment->input_file);

        Pos = 0;
        while (Pos < IspEnvironment->BinaryLength)
        {
            if (FileContent[Pos] == '\r')
            {
                Pos++;
                continue;
            }

            if (FileContent[Pos] == '\n')
            {
                Pos++;
                continue;
            }

